In [1]:
import pandas as pd
import numpy as np

In [30]:
gini = pd.read_excel("gini_index.xlsx", sheet_name = "Data")

In [13]:
gini = gini.dropna().reset_index(drop = True)

In [14]:
gini.to_excel("gini_index.xlsx")

In [ ]:
#gini cleaned

In [ ]:
#combine the state column from gini and the median state housing price

In [31]:
gini = pd.read_excel("gini_index.xlsx")

In [24]:
house = pd.read_excel("housing_cost.xlsx", sheet_name = "median_housing")

In [60]:
#take the value we need from the housing data and reindex them
condition = house["Label"] =="Renter-occupied housing units"
median = house[condition].reset_index(drop = True).drop("Label", axis = 1)

In [63]:
#now, take the state information from gini data
median_data = pd.DataFrame(gini["Label"])
median_data.head()

        Label
0     Alabama
1      Alaska
2     Arizona
3    Arkansas
4  California

In [64]:
#now combine the housing value to the state info as a new column and finish the process
median_data["median_housing_price"] = median

In [67]:
median_data.head()

        Label median_housing_price
0     Alabama                  861
1      Alaska                1,259
2     Arizona                1,253
3    Arkansas                  820
4  California                1,750

In [68]:
median_data.to_excel("median_housing.xlsx")

In [69]:
#now clean the income data

In [70]:
income = pd.read_excel("mean_median_income.xlsx", sheet_name = "Data")
income.head()

        Label Median income (dollars) Mean income (dollars)
0     Alabama                     NaN                   NaN
1  Households                  53,913                75,923
2    Estimate                     NaN                   NaN
3    Families                  71,006                92,591
4    Estimate                     NaN                   NaN

In [79]:
#take only the households value
condition = income["Label"] == "Households"
income = income[condition].reset_index(drop = True).drop("Label", axis = 1)

In [81]:
#combine the state name and the income data
income["state"] = gini["Label"]

In [86]:
#reindex the data so that state comes first in the column
income = income.reindex(labels = ["state", "Median income (dollars)", "Mean income (dollars)"], axis = 1)
income.head()

        state Median income (dollars) Mean income (dollars)
0     Alabama                  53,913                75,923
1      Alaska                  77,845               100,519
2     Arizona                  69,056                93,177
3    Arkansas                  52,528                73,126
4  California                  84,907               120,953

In [87]:
#export to excel
income.to_excel("income_data.xlsx")

In [90]:
#now do the same thing for the employment data
emply = pd.read_excel("emply_status.xlsx", sheet_name = "Data")
emply.head()

,Label,POVERTY STATUS IN THE PAST 12 MONTHS,Below poverty level,At or above the poverty level,Less than high school graduate,High school graduate (includes equivalency),Some college or associate's degree,Bachelor's degree or higher
0,Alabama,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Total,NaN,"426,232","2,403,734","291,364","762,320","780,194","731,521"
2,Estimate,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Labor Force Participation Rate,NaN,41.8%,79.4%,49.4%,67.4%,74.7%,85.2%
4,Estimate,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [95]:
condition = emply["Label"] == "Unemployment rate"
emply = emply[condition].reset_index(drop = True).drop(
        [
        "POVERTY STATUS IN THE PAST 12 MONTHS", 
        "Label"]
        , axis = 1)

In [96]:
#since the data is already ordered by states, we can export it
emply.head()

,Below poverty level,At or above the poverty level,Less than high school graduate,High school graduate (includes equivalency),Some college or associate's degree,Bachelor's degree or higher
0,22.4%,3.4%,11.0%,6.0%,4.4%,1.9%
1,29.2%,5.0%,17.0%,9.1%,5.6%,3.0%
2,23.6%,4.0%,8.5%,6.5%,5.5%,2.9%
3,23.2%,3.6%,8.8%,6.2%,5.0%,2.0%
4,29.9%,6.4%,9.4%,9.3%,8.8%,5.1%

In [124]:
emply.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   Below poverty level                          52 non-null     float64
 1   At or above the poverty level                52 non-null     float64
 2   Less than high school graduate               52 non-null     float64
 3   High school graduate (includes equivalency)  52 non-null     float64
 4   Some college or associate's degree           52 non-null     float64
 5   Bachelor's degree or higher                  52 non-null     float64
dtypes: float64(6)
memory usage: 2.6 KB

In [123]:
emply["Below poverty level"] = emply["Below poverty level"].str.strip("%").astype("float")/100
emply["At or above the poverty level"] = emply["At or above the poverty level"].str.strip("%").astype("float")/100
emply["Less than high school graduate"] = emply["Less than high school graduate"].str.strip("%").astype("float")/100
emply["High school graduate (includes equivalency)"] = emply["High school graduate (includes equivalency)"].str.strip("%").astype("float")/100
emply["Some college or associate's degree"] = emply["Some college or associate's degree"].str.strip("%").astype("float")/100
emply["Bachelor's degree or higher"] = emply["Bachelor's degree or higher"].str.strip("%").astype("float")/100

In [125]:
emply.head()

,Below poverty level,At or above the poverty level,Less than high school graduate,High school graduate (includes equivalency),Some college or associate's degree,Bachelor's degree or higher
0,0.224,0.034,0.110,0.060,0.044,0.019
1,0.292,0.050,0.170,0.091,0.056,0.030
2,0.236,0.040,0.085,0.065,0.055,0.029
3,0.232,0.036,0.088,0.062,0.050,0.020
4,0.299,0.064,0.094,0.093,0.088,0.051

In [126]:
emply.to_excel("unemployment.xlsx")